Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Tapas] A Wife's Sweet Revenge.tmx
Source language: ko_kr
Languages: en

source: 오늘도 힘내세요.
en: have a good one.

source: 이렇게 많이는 안 돼요.
en: we can’t bring this many.

source: 아뇨, 괜찮아요.
en: no, it’s fine.

source: 그래서요?
en: so?

source: 누구 말이야?
en: who?

source: 이유가 뭐야?
en: What’s the reason?

source: 오빠가 결혼했다가 버린 년!
en: ...the one changyeob married then dumped!

source: 고마워요.
en: thank you.

source: 혹시 몰라서 몇 가닥 더 챙겼습니다.
en: i bagged a couple more just in case.

source: 당분간은 이렇게 해요, 걱정되니까.
en: let’s just do it this way for the time being. i’m worried.

source: 무슨 일 있나요?
en: did something happen?

source: 물론이죠.
en: Of course.

source: 정말로 헤어졌어요.
en: We really broke up.

source: 안 먹었으면 같이 먹죠.
en: if you haven’t, let’s eat together.

source: 네, 이대로요.
en: keep it up.

source: 아, 이거 놔 봐요!
en: let go of me!

source: 대현 씨가 왜 미안해요.
en: there’s no reason for you to be sorry, daehyun.

source: 아유, 고마워서 어쩌나.
en: Goodness. Thanks so much

source: 다행이네요.
en: that’s a relief.

source: 얘기…요?
en: You do...?

source: 그럼.
en: bye.

source: 네, 오늘 찾으러 오신다고 하셨는데….
en: Yes, he said that he would drop by today...

source: 한빈이가 저렇게 좋아하는데.
en: look at how excited hanbin is.

source: 정말 고맙습니다.
en: Thank you so much.

source: 엄마인데… 내가 엄마인데….
en: i’m his mom... i’m supposed to be his mom...

source: 좀 됐어요.
en: it’s been a while.

source: 회사도 안 다니면서 이젠 집안일 같은 건 좀 스스로 좀 하고,
en: if you’re not working, can’t do some chores for a change...

source: 네, 들었어요.
en: yes, she did.

source: 그동안 연락도 잘 안 되고… 걱정했어요.
en: i wasn’t able to reach you... i was worried.

source: 네, 끝났나요?
en: hi, is it done?

source: 배고프다.
en: i’m hungry.

source: 그럼 봐두신 집이라도 있으세요?
en: then is there a place you’re thinking of?

source: 아들
en: son

source: 그년, 제정신이 아니라는 걸 말해주고 싶어.
en: i came to warn you that she’s no ordinary b*tch.

source: 내일부터는 일이 좀 더 힘들어질 거예요.
en: work is going to get harder starting tomorrow.

source: 고마워요, 영수 선생님.
en: thank you, youngsoo.

source: 오늘 공룡 사탕 아저씨네서 자는 거예요?
en: are we going to sleep over at mr. dino lollipop’s house today?

source: 궁금한 게 있는….
en: i’ve been meaning to ask...

source: 넌 몰라.
en: It’s not.

source: 어떻게 해서든 찾아내세요.
en: ...so find him, no matter what.

source: 와, 좋죠!
en: wow, that sounds amazing!

source: 귀여워라.
en: he’s adorable.

source: 선물 받으시면 좋아하실 것 같네요.
en: The owner of the cafe will love it.

source: 그럼요, 이해하죠.
en: of course. i understand.

source: 그년… 왠지 들어본 적 있는 목소리 같았어….
en: That b*tch... I’ve heard her voice somewhere...

source: 아이 어머니가 아닌 이상 한빈이는 내드릴 수 없습니다.
en: we can’t let anyone but hanbin’s mother take him.

source: 다영 씨, 진정해.
en: dayoung, stay calm.

source: 딱 걸렸어.
en: caught her red-handed.

source: 그래, 이제 엄마 바꿔주련?
en: good, now could you give your mommy the phone?

source: 정말 괜찮겠습니까?
en: ...but is all of this really okay?

source: 알겠어요, 기다릴게요.
en: got it. i’ll be waiting.

source: 당연히 저도 같이 가야죠.
en: of course i have to go too.

source: 아저씨, 아저씨!
en: mister, mister!

source: 엄마, 수상해.
en: You’re acting suspicious, Mom.

source: 지금 일하는 중이라….
en: I'M WORKING NOW...

source: 좋은 사람 만나실 거예요.
en: ...you’ll definitely find a good person.

source: 먼저 가볼게요.
en: I’ll get going.

source: 그 다음에는…
en: After that...

source: 아가씨, 이거 놓고 얘기 해요!
en: get your hands off her, miss!

source: 요즘 정말 살맛 나는 것 같아요.
en: lately, it feels like life is worth living.

source: 출근하셔야 한다니.
en: that you have to go to work now.

source: 하룻밤 동안 이렇게…?
en: all of this in one night...?

source: 곧 저는 다른 남자들에게 안기게 될 거예요.
en: I’ll have to sleep with other men soon.

source: 갑자기 웬 돈이 필요하다고 그러세요?
en: Why do you need money out of the blue?

source: 경찰에 연락해요!
en: call the police!

source: 가게에 피해는 없죠?
en: the store is fine, right?

source: 한빈이가 위치추적기를 달았다는 것을 아는 사람일 겁니다.
en: it must be someone who knew he was wearing one.

source: 다영 씨가 누구랑 밤을 보내게 되든,
en: No matter who you spend the night with,

source: 67화
en: episode 67

source: 지금 한빈이의 위치로 보면…
en: looking at hanbin’s location now...

source: 예, 고마워요.
en: yes, thank you.

source: 우선 밥부터 먹자.
en: let’s eat.

source: 이 여자, 들어가서는 나오질 않네.
en: that woman’s not coming out.

source: 아, 당신 왔어?
en: oh, you’re back.

source: 이건 어때요?
en: Then how about this?

source: 다, 다영 씨.
en: D-Dayoung.

source: 그 미친년이 무슨 짓을 꾸몄냐 하면…!
en: let me tell you what that b*tch is up to...!

source: 많이 보고 싶었습니다, 다영 씨…!
en: i really wanted to see you, dayoung...!

source: 그럼, 한빈아.
en: okay, hanbin.

source: 손님용 찻잔이 너무 높이 있네….
en: I didn’t realize how high up the cups for the guests were...

source: 애요?
en: a kid?

source: 다영 씨, 수고 많았어.
en: good work, dayoung.

source: 아무리 그래도 그렇지,
en: i know how you feel...

source: 이게 무슨 소리야?
en: what is she talking about?

source: 뭐, 그래도 확인해 보는 게 나쁠 건 없으니깐.
en: But I guess it can’t hurt to make sure.

source: 그럼 부탁할게요.
en: Thank you.

source: 찾았어요, 그 여자.
en: i found her. the woman you were looking for.

source: 왜 그래, 무슨 일인데?
en: what was that about?

source: 에에, 그러니까.
en: uh, so...

source: 한빈이는 제가 잘 데리고 있을게요.
en: i’ll take care of hanbin.

source: 창엽이는?
en: what about changyeob?

source: 아니, 아니.
en: no, no.

source: 따로 선물할 사람이 있어.
en: That’s for someone else.

source: 무슨 수를 써서든 그 아이, 찾아내요!
en: i want you to find that kid, whatever it costs!

source: 이제 퇴근해요?
en: did you just get done with work?

source: 다영 씨는 일해요.
en: keep working, dayoung.

source: 제가 왜 이러는지….
en: ...why I’m doing this.

source: 마실 것 좀 사올게요.
en: i’ll go get us something to drink.

source: 설마, 이제 와서 양육비 소송이라도 걸 생각은 아니겠지?
en: i hope you’re not thinking of suing for child support after all this time?

source: 제가 있는 곳으로 와줄 수 있으세요?
en: Can you come here right now?

source: 영수 선생님은 정말 재미있는 분이세요.
en: You’re so funny, Youngsoo.

source: 아, 마침 저기 오네요.
en: Ah, here he comes now.

source: 근무 시간 동안 있는 지출인데, 당연히 법인 카드 써야죠.
en: you’re still on the clock, so you should be using the company card.

source: 호호.
en: Huhu.

source: 지금 전화 해보세요.
en: you should make the call now.

source: 59화
en: episode 59

source: 알다마다요.
en: How could I not?

source: 그 여자는 까다롭지 않겠지?
en: She probably wouldn’t be this picky, right?

source: 요즘 연락이 안 돼서 걱정하고 있었어요.
en: i was worried because i haven’t been able to reach you lately.

source: 쉿!
en: Shh!

source: 그동안 나한테 줬던 꽃다발.
en: the flowers you’ve been getting me all this time.

source: 이게 무슨 고생이야!
en: it’s her fault that i’m in this mess!

source: 네, 네.
en: yes, yes.

source: 연락… 기다리고 있겠습니다.
en: I’ll be waiting... for your call.

source: 박순 씨!
en: baksoon!

source: 아, 아뇨.
en: Oh, no.

source: 흐윽…!
en: *sob*

source: 이제… 와요?
en: you’re... back.

source: 흐음, 그렇단 말이지….
en: hmm, is that right...?

source: 문 여십시오.
en: so please open the door.

source: 기대되는걸~!
en: let’s see it!

source: 감기 기운이 좀 있는 것 같아서.
en: I’m feeling under the weather all of a sudden.

source: 으응…!
en: okay...!

source: 그래서…
en: And so...

source: 용가리 너겟!
en: dino nuggets!

source: 아니, 그런 몹쓸…!
en: what, that rotten little...!

source: 제가 뒤를 밟아보니, 어느 아파트 단지로 들어가더군요.
en: i followed her and saw her enter an apartment complex.

source: 그래서 이자 감당하려면, 당분간 여사님 말고도,
en: So if I want to afford the interest, I’ll have to work hard,

source: 고맙습니다!
en: Thank you!

source: 오늘은 이만 퇴근하죠.
en: let’s clock out for today.

source: 앉아요.
en: Have a seat.

source: 알 거 없어.
en: You don’t need to know.

source: 이거….
en: Here...

source: 그럼 애는 이 원룸에 없겠네.
en: then the kid probably isn’t in the studio.

source: 이제 곧, 끝난다.
en: it’ll be all over soon.

source: 오늘이요…?
en: Today...?

source: 어서 와요, 둘 다.
en: welcome back, you two.

source: 그럼 이따 봬요.
en: I’ll see you later.

source: …그거 말고는 제가 도울 수 있는 일은 없는 거예요?
en: Is there no other way for me to help...?

source: 예, 어머니.
en: yes, mother.

source: 기왕 온 거,
en: since you came all this way...

source: 예, 사장님.
en: yes, boss.

source: 유치원에서 이 시간에?
en: the school’s calling me at this hour?

source: 그나저나 이 집 정말 마음에 드네요.
en: anyhow, i adore the place.

source: 한빈이를 찾지 못했을 거예요….
en: we wouldn’t have been able to find him...

source: 에그머니, 주책이야…!
en: My word, what’s wrong with me today...?

source: 예뻐요.
en: It’s pretty.

source: 영수 선생님이라면,
en: if it were up to you,

source: 주문하신 꽃다발은 여기 있어요.
en: Here’s that bouquet you ordered.

source: 저는 그걸 역으로 쫓고 있었고요.
en: i’ve been trying to follow them back.

source: 이런 걸로 뭘요.
en: Don’t worry about it.

source: 그 남자친구였던 사람한테 흥신소 사람을 붙이는 둥 뭐라는 둥…
en: she was going on about having a private eye follow her ex...

source: 마침 위층에 있던 호프집 사장님하고 얘기 나누고 돌아가던 길이었는데,
en: I was speaking with the owner of the bar upstairs, and I was just about to leave,

source: 아니, 당분간 여기엔 오지 말어.
en: no, stay away from the shop for now.

source: 당신이 아니고서야….
en: if that wasn’t you...

source: 너무 걱정 마십시오.
en: please don’t worry too much.

source: 아니, 저 여자 말만 듣고 이러면 곤란합니다!
en: hey, don’t just take that woman’s word for it!

source: 꽃집에 가서 사장님한테 인사 좀 하고 올게요.
en: i’m going to the flower shop to say hi to ms. min.

source: 사실, 영수 선생님 보고 싶어서
en: To be honest, I got special permission from my boss to come in late today...

source: 그 여자분이 왜요?
en: what about her?

source: 우리 아들, 잘 다녀왔어?
en: Hanbin, how was school today?

source: 유치원 잘 다녀왔어, 우리 아들?
en: How was school, sweetheart?

source: 웬일이야?
en: What’s up with you?

source: 벌 받을 거예요.
en: are going to get what’s coming to you.

source: 보수는 현금으로, 월요일에 찾아가서 직접 드리죠.
en: i’ll come by this monday and pay you in cash.

source: 그럼 항상 만났던 거기서….
en: Then I’ll see you at the usual place...

source: 사장님께서 이것저것 배려해주셔서요.
en: And the boss is very understanding.

source: 당연히 일상 대화들 녹음해 두었죠.
en: i recorded our conversations, of course.

source: 분명 저번과 같은 사람 짓이에요.
en: i’m confident this is the work of the same people as before.

source: 꽃집에 불청객이 찾아 왔다고 해서요.
en: ...ms. min told me that the flower shop had some unwanted visitors.

source: 뭐하시느라 그렇게 바쁘세요?
en: What has you so busy?

source: 아유… 정말 죄송해요.
en: goodness... i’m so sorry.

source: 이쪽으로 앉으시죠.
en: please take a seat over here.

source: 그럼 공룡 사탕 아저씨,
en: then...

source: 대현 씨…!
en: daehyun...!

source: 좋아, 그럼 과자 코너도 가볼까?
en: all right. why don’t we go to the snack aisle then?

source: 아니, 이 여자 말이야.
en: it’s just, the woman in this photo.

source: 이런 분과 감히 헷갈리다니.
en: I can’t believe I thought you were the same person.

source: 자, 여기 선물!
en: Here, for you!

source: 다영 씨 몰래 이런 얘기 한 게 불쾌하실 수도 있겠지만….
en: i understand if you’re angry that we discussed this behind your back but...

source: 어서 사러 가요, 우리.
en: let’s go buy some right now.

source: …여보세요?
en: hello...?

source: 그년 누구야?
en: Who is that b*tch?

source: 이거 봐!
en: look at this!

source: 한빈이도 아침 먹자.
en: you too, hanbin.

source: 이대로 집에 들어가면 위험할 것 같은데.
en: i don’t think it’s safe for you to go home right now.

source: 왜 그래요, 다영 씨?
en: What’s the matter, Dayoung?

source: 왠 전화를….
en: why’d you call me so many times...?

source: 이년이 무슨 짓을 했는지 다 까발릴 거야!
en: ...and expose every last thing that she has done!

source: 급하게 결정된 거라 말할 틈이 없었어요.
en: IT HAPPENED SO SUDDENLY THAT I DIDN'T HAVE A CHANCE.

source: 잠깐만요, 전화가….
en: wait, it’s my phone...

source: 쉽게 안 넘어오네.
en: but she’s not easy.

source: 선약이 있어서.
en: I’m meeting someone else today.

source: 그 여자한테 받은 것들은요?
en: what did you do with the things you got from that woman?

source: 다영 씨도 충분히 좋은 분이세요.
en: You’re a good person too, Dayoung.

source: 사장님 덕분에 제가 하는 일이 잘 되고 있는 거 같아요.
en: I feel like things are going smoothly thanks to you.

source: 예에…
en: Oh, yes...

source: 그거 돈 많이 들어요?
en: Do you need a lot of money for that?

source: 오늘 무슨 일 있었어요?
en: Did something happen today?

source: 아마도 다영 씨가 목적인 흥신소같은 곳이겠죠.
en: i’m guessing it was some sort of private investigator hired to find you.

source: 이게 다 그년 때문이야!
en: this is all that b*tch’s fault!

source: 그저 젊은 사모님한테 의뢰 받았다고만….
en: he only said he was hired by a young, married woman...

source: 놓치면 안 돼!
en: i can’t lose sight of her!

source: 후후, 저도 한빈이가 많이 보고 싶네요.
en: huhu, i really miss him too.

source: 그럼 사장님, 안녕히 계세요.
en: Have a good day, Ms. Min.

source: 그… 그랬어?
en: d-did she?

source: …뭐, 설마 무슨 일이야 일을라고.
en: oh, well... i’m sure it’ll be fine...

source: 도대체 애를 어떻게….
en: how could you let this happen...

source: 정말요…?
en: Really...?

source: 정말 도움 안 된 다니까!
en: god, he’s never any help!

source: 그렇군요, 알겠어요.
en: I see, I understand.

source: 그게 무슨 소리예요?
en: What are you talking about?

source: 다영 씨가 믿어주신다면 그걸로 됐습니다.
en: As long as you believe me.

source: 예, 맞아요.
en: yes, you’re right.

source: 뭐야…!
en: What the hell...!

source: 흐, 흥, 뭐 이런 걸로….
en: a-hem, this is nothing...

source: 드디어 연락이 됐네!
en: you finally picked up!

source: 저 같은 사람 말고….
en: Someone who’s the opposite of me...

source: 그것들을 모두 부숴버리기 전에는…!
en: not until I’ve crushed them all...!

source: 영수 선생님이랑 있는 시간은 정말 즐거워요.
en: i have so much fun when i’m with you, youngsoo.

source: 엄마, 애들은 쪼끄마해!
en: mommy, look at how tiny they are!

source: 아뇨~, 좋아요~ 만나요~!
en: No. That sounds great! Let’s meet up!

source: 당신이 무슨 짓을 했길래?
en: what exactly did you do?

source: 그 년이야.
en: it was that b*tch.

source: 그 안에 찾아내 드릴테니.
en: i will find her for you.

source: 그렇잖아.
en: It’s true, isn’t it?

source: …네, 잘 생각해 볼게요.
en: Okay... I’ll consider it.

source: 눈 감고도 꼬실 수 있습니다.
en: I could seduce her with my eyes closed.

source: 알겠다.
en: all right.

source: 끄응…
en: hngh...

source: 그럼 우리…
en: Then...

source: 지금 만나요.
en: meet me right now.

source: 창희는 어떡하고요?
en: where is she supposed to live?

source: 아아.
en: Ahh.

source: 어머, 한빈이 혼자서도 할 수 있는데….
en: oh my, hanbin can do it himself...

source: 죄송하지만, 미아 신고는 접수된 게 없습니다.
en: i’m sorry, but we haven’t gotten any reports about a lost child.

source: 어서 박순 씨와 살림을 합치고 싶군요.
en: i want to start living together as soon as possible, my love.

source: 오늘요?
en: Today?

source: 내가 이 나이에 성냥갑 같은 집에 들어가서,
en: are you telling me to live in a closet at my age?

source: 어차피 내 거가 만혁 씨 거가 되고,
en: what’s mine will be yours...

source: 모험을 한 승완 씨에게 상을 줘야겠죠.
en: I should reward you for taking this gamble.

source: 그 안에 위치 추적기가 들어 있어요.
en: the tracker’s in there.

source: 어머니, 오늘 제인이 좀 봐주실 수 있을까요?
en: Baksoon, could you babysit Jaein today?

source: 그림 :
en: Art by:

source: 영수 씨를 어떻게 꾀어냈길래…!
en: just how did she seduce youngsoo like this...?!

source: 알지.
en: well, sure.

source: 금방 찾을 수 있을 거예요.
en: ...so they should be able to find him soon.

source: 우린 진짜 잠깐 데리고 있었던 것뿐이에요.
en: we really were just looking after him for a bit.

source: 여기가… 사무실이에요?
en: is this... your office?

source: 좋게 봐주셔서 고마워요.
en: Thank you for your kind words.

source: 웬 거야?
en: What’s this?

source: 대현 씨가 좋은 사람인 만큼 전 지금 대현 씨를 만나면 안 돼요.
en: You’re too good of a person for me to go out with you.

source: 여기서 이러고 있다가 사람 오면 어떡해?
en: What if someone sees us?

source: 으응, 그게 말이에요.
en: yes, that’s the thing.

source: 어디에요?
en: Where?

source: 오늘… 만나요.
en: Let’s meet... today.

source: 하지만 영수 선생님은 ….
en: Youngsoo, you...

source: 다 차단.
en: they’re all blocked.

source: 무슨 일이길래 우리 박순 씨 기분이 이렇게 좋아진 겁니까?
en: what could have made you so happy, my love?

source: 못 해…!
en: I can’t...!

source: 저도 방금 전에 왔어요.
en: I just got here too.

source: 지금 내가 해야할 건, 조창희한테서 이승완을 빼앗는 거야.
en: Right now, my goal is to take Seungwan Lee away from Changhee.

source: 그래요.
en: All right,

source: 그래서 그러시는 건지 딱히 신경 쓰고 싶지 않으신가 봐.
en: maybe that’s why, but she seems like she doesn’t want to get involved.

source: 일찍 왔네, 오늘?
en: you’re early today.

source: 모르는 척 하시는 거예요?
en: ...are you pretending to be?

source: 하하, 한빈이 졸린가 보네요.
en: haha, it looks like hanbin is getting sleepy.

source: 한빈이도 좋아하는데,
en: hanbin wants it too.

source: 남영수 부재중 전화 (1통)
en: YOUNGSOO NAM MISSED CALL

source: 그렇게 연인이셨던 분하고 오래전에 헤어지게 되셨던 거군요.
en: So that’s how you separated with your partner.

source: 안 받네….
en: she’s not picking up...

source: 아가씨한테 영수 씨와의 관계를 들키지만 않았었어도…!
en: ...youngsoo and i had never been caught by miss changhee...!

source: 하나는 끝.
en: that’s one down.

source: 그냥 그 아이의 존재 자체가 없어졌으면 좋겠으니,
en: i just want that child gone...

source: 남의 남자 건드리니까 좋아?
en: is stealing other people’s men fun for you?

source: 63화
en: episode 63

source: 짜증 나니까 들러붙지 마.
en: stop being so clingy.

source: …대현 씨한테 부탁이 있어요.
en: I have a favor to ask you, Daehyun...

source: 유치원에서 연락이 왔어.
en: his school called.

source: 어쨌든 끝까지 쫓아가야겠지?
en: either way, i should follow her to the end, right?

source: 정말 고마워요….
en: thank you so much...

source: 분명 제인이 또래 정도로 보이던….
en: i’m sure he was around jaein’s age...

source: 그래도 꽃다발은 다영 씨가 만든 게 가장 좋아서요.
en: ...but the bouquets you make are the best.

source: 아무것도 생각하지 말고 다영 씨하고 한빈이만 생각해.
en: Don’t think about anything else and focus on yourself and Hanbin.

source: 마음 약해지거나 딴 생각하면 안 돼요.
en: ...we can’t back down or second-guess ourselves now.

source: …비서요?
en: your secretary...?

source: 무슨 얘기요?
en: what do you mean?

source: 나 바빠.
en: i’m busy.

source: 대체 누가…!
en: by whom...?!

source: 말씀은 맞지만…,
en: you’re right...

source: 흥, 돈이 문제라면 지금이라도…!
en: hmph, if you need more money, just...!

source: 조 대표, 아는 분이셔?
en: Do you know each other, Mr. Cho?

source: …그 사람들 짓이겠죠?
en: ...is probably their doing, right?

source: 너무 번거롭게 해드리는 것 같아서 죄송해요.
en: i’m sorry for making you go through this trouble.

source: 너랑 상관 없는 사람이야.
en: They have nothing to do with you.

source: 무슨 생각을 하고 있길래,
en: what are you thinking about?

source: 시간을 잘 맞춰서 왔네, 내가.
en: I guess I got here just in time.

source: 어땠어?
en: How was it?

source: 할머니!
en: grandma!

source: 생각보단 쉽군.
en: This is easier than I thought.

source: 잘 지내죠?
en: is she doing okay?

source: 당신, 그래서 그동안 그렇게 얼굴이 안 좋았던 거야?
en: is that why you looked so out of it all this time?

source: 그리고 날 봐요.
en: And look at me.

source: 이걸로…
en: i’m sure i can use this...

source: 그 여자한테 줄 겁니다.
en: I’m going to give it to her.

source: 물었다!
en: She took the bait!

source: 네에…?
en: what...?

source: 한빈이가 사장님 너무 보고 싶어 하더라고요.
en: hanbin really misses you, ms. min.

source: 으응?
en: What?

source: 발신기 위치가 유치원 인근에서 움직이질 않는 걸 보니,
en: based on how the tracker’s location is stuck at the school,

source: 도대체 뭐야, 저 여자?
en: what is she?

source: …이게 어제 라고요?
en: this was yesterday...?

source: 오늘… 보고 싶어서요.
en: I... wanted to see you today.

source: 하아, 하아….
en: haa, haa...

source: 으응.
en: i am.

source: 꽃말도 인상적이고.
en: They have an unforgettable symbolic meaning, too.

source: 요즘 도통 연락이 안 되네.
en: she hasn’t been picking up.

source: 이제 와서 저 여자가 알았다고 어떻게 될 사이는 아니니까요.
en: her finding out doesn’t change a single thing at this point.

source: 빠르면 내일이라도 연락 드리겠습니다.
en: i’ll give you a call when it’s done, possibly even tomorrow.

source: ...그나저나.
en: By the way...

source: 감사합니다, 사장님.
en: thank you, boss.

source: 괜찮으니까 받아 봐요.
en: it’s fine. you can take it.

source: 한빈이 찾았으니까, 이제 마음 좀 내려놔.
en: you got hanbin back, so go and take a load off.

source: 그럼 택시 타는 것까지는 보고 갈게요.
en: then i’ll stay with you until you get a taxi.

source: 손자 하나가 생겼으니 한시름 덜었어요.
en: i can breathe a little easier knowing i have a grandson.

source: 계세요.
en: no, you stay.

source: 아니야, 그래도 여기선 아닌 거 같아…!
en: No, we shouldn’t be doing this here...!

source: 말이라고 해요!?
en: ...kidding me?!

source: 그래서 저한테 일부러 접근한 거라고,
en: and that’s why you approached me...

source: 복수?
en: revenge?

source: 아, 그렇다니 까요!
en: i swear, it’s true!

source: 무슨 소리야.
en: What are you talking about?

source: 잘 보여야할 사업 파트너죠.
en: Well, he’s a business partner I want to impress.

source: 나, 요즘 진지하게 만나는 여자 생겼거든.
en: there’s a girl who i’m getting serious about.

source: 정말 잘하시네요!
en: That was amazing!

source: 이 사람들이 끝까지…!
en: you people...!

source: …아, 미안합니다.
en: Oh, I’m sorry.

source: 너, 그거 확실한 거야?
en: are you certain about this?

source: …어?
en: huh...?

source: 그래, 한빈이 공룡 친구들 다 데리고 가자.
en: okay, let’s bring all of your dino friends.

source: 이대로만 진행되면…,
en: and if things keep going the way they are...

source: 오늘 사정 봐주셔서 감사해요, 사장님.
en: Thank you for being so understanding, Boss.

source: 두 곳 다 제 명의로 계약해도….
en: to put them both under my name...

source: 예에, 노력하고 있습니다.
en: yes, we are trying our best.

source: 오늘은 제 말대로 해요.
en: please just go along with it.

source: 내 손주라고?
en: ...my grandson?

source: 자, 아저씨랑 찾으러 가볼까.
en: now, why don’t you and i go find them?

source: 손주 사랑이 지극한 최박순.
en: baksoon choi, the extremely doting grandmother.

source: 어땠나요?
en: How did it go?

source: 오늘은 그 여자랑 놀아볼까?
en: Let’s play with that woman today, shall we?

source: 아무리 그래도 그렇죠, 어머니.
en: even if that’s true, this isn’t right.

source: 애 말이다!
en: i was talking about the kid!

source: 그, 그게…
en: U-Uh...

source: 약속이 있어서 안 된다.
en: I can’t. I’m meeting up with someone.

source: 목숨을 살려줬더니 그딴 식으로 사람을 대하다니!
en: I can’t believe they treated you like that after the sacrifice you made!

source: 아무튼, 알겠습니다.
en: anyway, i understand.

source: 그럴 리가요.
en: not a chance.

source: 엄마아~
en: Mommyyy!

source: 벌써요?
en: already?

source: 우리도 어서 가요.
en: let’s get in bed too.

source: 아...
en: Ah...

source: 망아지 같던 꼬맹이는 저 남자 씨인가 보네요.
en: and that must be the brat’s father.

source: 꿋꿋이 이겨내고 계시잖아요….
en: but you’ve kept your head up despite everything...

source: 이제 전 다영 씨랑 사귀는 사이니까 선을 그었더니,
en: i tried to set some boundaries with her since i’m dating you now...

source: 행여 나랑 어떻게 엮어 볼 생각인 거면 꿈 깨.
en: so if you’re trying to get me involved in his life, then wake up.

source: 한빈이 데리고 올게요.
en: i’ll go pick up hanbin.

source: 기왕 온 김에 말인데…,
en: while i’m here, i have something to ask you...

source: 기회가 오면 일을 진행 하겠습니다.
en: we’ll proceed as soon as an opportunity presents itself.

source: 일하는 직원은 여기 있는 둘 뿐입니다만…?
en: these two are my only employees...

source: 우선 어머님 전화 끊어봐.
en: so you can hang up first.

source: 이 여자, 알아?
en: this woman. do you know her?

source: 제가 지금 그런 행복을 바랄 때는 아니예요.
en: This isn’t the time to be wishing for that kind of happiness.

source: 꽤 고마워하고 있던 사람인걸요.
en: I owe her a great debt.

source: 참, 그리고 하나 말씀드리고 싶은 게….
en: Oh yes, there’s something I have to tell you...

source: 못 찾으면 그땐….
en: then...

source: 네… 너무 좋았죠.
en: Oh, right... We definitely did.

source: 누군지 알 것 같아요.
en: ...i have an idea who it could be.

source: 정말 고마워요, 대현 씨
en: thank you so much, daehyun.

source: 75화
en: episode 75

source: 그렇죠?
en: Right?

source: 사실, 오늘 이분하고 선약이 있거든요.
en: Actually, I was supposed to meet this gentleman here.

source: 우선 가서 확인부터 해봐요, 우리.
en: let’s ask them, and then we can think about what to do next.

source: 그럼 또 중요한 일 하러 가죠.
en: then let’s go do some more important work.

source: 정,
en: R-

source: 이젠 남편한테 집중해.
en: go focus on your husband.

source: 예쁘네요.
en: they’re gorgeous.

source: 그래요!
en: exactly!

source: 어서 오세…
en: Welco...

source: 오늘도 힘내십시오, 다영 씨.
en: keep up the good work, dayoung.

source: 괜찮습니다.
en: no need to apologize.

source: 다영 씨한테 맡기길 잘했네요.
en: It’s a good thing I had you pick it out.

source: 아침에 사가신 거잖아요?
en: the bouquet you bought this morning, right?

source: 아주 좋아요.
en: great.

source: 지금 아이 친부라고 하는 분이 찾아 오셨는데요.
en: we have a man here claiming to be hanbin’s biological father.

source: 그래서 한빈이도 엄마 일하시는 동안 얌전히 놀았지?
en: you were playing quietly for the same reason, right, hanbin?

source: 드디어…
en: At last...

source: 정말 감사해요.
en: Thank you so much.

source: 한빈이는 공룡 시리얼!
en: i want dino cereal!

source: 자, 우리 한빈이 어떤 칫솔인지 볼까?
en: all right then, can you show me what kind of toothbrush you have?

source: 또 연락 드릴게요.
en: i’ll call again later.

source: 아쉽지만 다음에 보자.
en: It’s a shame, but I’ll see you next time.

source: 오늘 일….
en: ...what happened today...

source: 그 아이는 조창엽 씨의 친자가 맞네요.
en: he is changyeob cho’s biological child.

source: 아, 한빈이는 잘 재웠어요.
en: oh, but i did put hanbin to bed.

source: …한빈이 좀 바꿔줄 수 있나?
en: could you put hanbin on for a moment...?

source: 뭐든 시켜만 주십시오.
en: Just give me the word.

source: 네~.
en: Sure.

source: 안 된대?
en: You can’t today?

source: 아무래도 실거주지는 아파트인 것 같습니다.
en: i think the apartment is her real home.

source: 그래도 혹시 모르니깐 조심하자고.
en: But we should be careful just in case.

source: …어머.
en: oh my...

source: 그년한테도 복수할 수 있게 됐잖아?
en: ...this way i’ll be able to get my revenge on that b*tch, too, right?

source: 저기… 다영 씨.
en: dayoung...

source: 오래 기다렸어요?
en: Have you been waiting long?

source: 엄마, 빨리이!
en: mommy, hurryyy!

source: 이제 와서 뭘 따지겠어요.
en: there’s nothing to discuss.
